Pandas is a Python library used for data analysis and data manipulation.
It provides two main data structures:

Series → one-dimensional data (like one column)

DataFrame → two-dimensional table (like Excel spreadsheet)

In [1]:
import pandas as pd

In [ ]:
#structure of series
series = pd.Series([1,2,3.0,4,5]) #its datatype preferece is object and float and int
#As per preference it will typecast
print(series)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [2]:
se = pd.Series(["a","c","srinu","vasu"])
print(se)
print(type(se))

0        a
1        c
2    srinu
3     vasu
dtype: object
<class 'pandas.core.series.Series'>

In [ ]:
#Creating a series from numpy ndarray
#Only applicable for 1D array
import numpy as np
arr = np.array([12,23,65,32])
se = pd.Series(arr)
print(se)

0    12
1    23
2    65
3    32
dtype: int64

In [12]:
#Data acessing using index
se = pd.Series([1,2,3,4,5,6])
print(se[2],"\n")
print(se[1:],"\n")
print(se[[1,4]])#Acessing first and fourth index

3

1    2
2    3
3    4
4    5
5    6
dtype: int64

1    2
4    5
dtype: int64

In [18]:
#Adding index manually
s = pd.Series([1,2,3,4,5,6],index=['a','b','c','d','e','f'])
print(s)
print(s['a'])
print(s['b':])

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64
1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [20]:
print(s[['a','c','f']])

a    1
c    3
f    6
dtype: int64

PANDAS DATAFRAME

In [23]:
#Creating a dataframe b using dictionary
data = {"name ": ['srinu','vasu','charan'],
        "roll": [1,2,3],
        "marks": [69,78,96]}
df = pd.DataFrame(data)
df.index = range(1, len(df) + 1)
df

    name   roll  marks
1   srinu     1     69
2    vasu     2     78
3  charan     3     96

In [ ]:
data = {"name ": ['srinu','vasu','charan'],
        "roll": [1,2,3],
        "marks": [69,np.nan,96]}#null   NaN=not an number
df = pd.DataFrame(data,index=[1,2,3])
df

    name   roll  marks
1   srinu     1   69.0
2    vasu     2    NaN
3  charan     3   96.0

In [26]:
#creating dataframe with tuple
data = [('1/1/2025',14,5,'Rain'),
        ('2/1/2025',13,6,'sun'),
        ('3/1/2025',14,3,'sun'),
        ('4/1/2025',12,8,'cloudy')]
df = pd.DataFrame(data,columns=['data','temperature','windspeed','climate condition'])
df

       data  temperature  windspeed climate condition
0  1/1/2025           14          5              Rain
1  2/1/2025           13          6               sun
2  3/1/2025           14          3               sun
3  4/1/2025           12          8            cloudy

Data Frame basic functionality

In [27]:
#create dictinary of series
dict ={ "name ":pd.Series(['srinu','vasu','charan','manoj','chandhu','karthik']),
       "age":pd.Series([21,20,19,29,18,21]),
       "Rating":pd.Series([9.9,8.9,7.0,7.8,8.9,6.5])}
df = pd.DataFrame(dict)
df

     name   age  Rating
0    srinu   21     9.9
1     vasu   20     8.9
2   charan   19     7.0
3    manoj   29     7.8
4  chandhu   18     8.9
5  karthik   21     6.5

In [28]:
#columns
df.columns

Index(['name ', 'age', 'Rating'], dtype='object')

In [29]:
#transpose of dataframe
df.T

            0     1       2      3        4        5
name    srinu  vasu  charan  manoj  chandhu  karthik
age        21    20      19     29       18       21
Rating    9.9   8.9     7.0    7.8      8.9      6.5

In [31]:
#for datatypes
df.dtypes

name       object
age         int64
Rating    float64
dtype: object

In [ ]:
#shape of the dataset
df.shape#(rows,columns)

(6, 3)

In [35]:
df.axes#returns list of row axes and column labels axes

[RangeIndex(start=0, stop=6, step=1),
 Index(['name ', 'age', 'Rating'], dtype='object')]

In [ ]:
#Gives datatypes of columns and non nulls
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   Rating  6 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 276.0+ bytes

In [40]:
#gives first five rows
df.head()

     name   age  Rating
0    srinu   21     9.9
1     vasu   20     8.9
2   charan   19     7.0
3    manoj   29     7.8
4  chandhu   18     8.9

In [42]:
#gives first two rows
df.head(2)

   name   age  Rating
0  srinu   21     9.9
1   vasu   20     8.9

In [44]:
#gives last 5 rows
df.tail()

     name   age  Rating
1     vasu   20     8.9
2   charan   19     7.0
3    manoj   29     7.8
4  chandhu   18     8.9
5  karthik   21     6.5

In [46]:
#gives last 3 rows
df.tail(3)

     name   age  Rating
3    manoj   29     7.8
4  chandhu   18     8.9
5  karthik   21     6.5

STATISTICS

In [47]:
df

     name   age  Rating
0    srinu   21     9.9
1     vasu   20     8.9
2   charan   19     7.0
3    manoj   29     7.8
4  chandhu   18     8.9
5  karthik   21     6.5

In [52]:
df.sum()#Adds column wise

name      srinuvasucharanmanojchandhukarthik
age                                      128
Rating                                  49.0
dtype: object

In [58]:
df.sum(axis=1,numeric_only=True)#adds row wise only numeric column

0    30.9
1    28.9
2    26.0
3    36.8
4    26.9
5    27.5
dtype: float64

In [60]:
#mean
df.mean(numeric_only=True)

age       21.333333
Rating     8.166667
dtype: float64

In [63]:
#standard deviation
df.std(numeric_only=True)

age       3.932768
Rating    1.292543
dtype: float64

In [67]:
#Median
df.median(numeric_only=True)

age       20.50
Rating     8.35
dtype: float64

In [69]:
df.describe()#summarises and gives the statistics of the data

             age    Rating
count   6.000000  6.000000
mean   21.333333  8.166667
std     3.932768  1.292543
min    18.000000  6.500000
25%    19.250000  7.200000
50%    20.500000  8.350000
75%    21.000000  8.900000
max    29.000000  9.900000

In [73]:
df.describe(include=['object'])#describes about categorical data

        name
count       6
unique      6
top     srinu
freq        1

In [77]:
df.describe(include=['number'])#describes about numerical data

             age    Rating
count   6.000000  6.000000
mean   21.333333  8.166667
std     3.932768  1.292543
min    18.000000  6.500000
25%    19.250000  7.200000
50%    20.500000  8.350000
75%    21.000000  8.900000
max    29.000000  9.900000

In [82]:
#we should not pass all as list
df.describe(include='all') #describes about all columns

        name         age    Rating
count       6   6.000000  6.000000
unique      6        NaN       NaN
top     srinu        NaN       NaN
freq        1        NaN       NaN
mean      NaN  21.333333  8.166667
std       NaN   3.932768  1.292543
min       NaN  18.000000  6.500000
25%       NaN  19.250000  7.200000
50%       NaN  20.500000  8.350000
75%       NaN  21.000000  8.900000
max       NaN  29.000000  9.900000